import matplotlib.pyplot as plt

# 准备数据
steps = [10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, 120000, 130000, 140000, 150000, 160000, 170000, 180000, 190000, 200000]
#psnr_values_model1 = [29.00278282, 29.60577202, 29.95669556, 30.08439445, 30.4533577, 30.28802299, 30.45974731, 30.52091217, 30.50240326, 30.5959301, 30.61452675, 30.70003891, 30.71336746, 30.66374016, 30.72753525, 30.82732964, 30.84883881, 30.68211937, 30.78206253, 30.90826797]
psnr_values_model2 = [14.05823, 27.43929, 28.52448, 28.96975, 28.71501, 28.98935, 29.06779, 28.85116, 28.98548, 29.10996, 28.95133, 28.89599, 29.30718, 29.16758, 29.05633, 29.44556, 29.28277, 29.34355, 29.18785, 29.48997]  # 第二个模型的 PSNR 数据
psnr_values_model3 = [21.95177, 13.4513, 28.34155, 28.42954, 28.37655, 29.1137, 28.59904, 28.77489, 28.73066, 28.43811, 28.75512, 28.96445, 28.69427, 28.62022, 28.66191, 28.91988, 28.65687, 29.22741, 29.25639, 29.10184]  # 第三个模型的 PSNR 数据
psnr_values_model4 = [28.68545, 28.45397, 28.27612, 28.70594, 28.61594, 28.50219, 28.60778, 29.03741, 29.09217, 28.42371, 29.44772, 28.46489, 29.04113, 29.1383, 29.52279, 28.73984, 28.70698, 29.05842, 28.84698, 29.40776]
psnr_values_model5 = [28.34639, 29.04786, 29.85794, 29.69482, 30.31037, 29.95663, 30.27608, 30.53357, 30.55874, 30.52141, 30.48402, 30.60402, 30.55445, 30.67772, 30.72587, 30.63995, 30.79713, 30.77269, 30.74576, 30.86698]
# ... 可以继续添加其他模型的 PSNR 数据

# 定义颜色列表
colors = ['blue', 'red', 'green', 'orange', 'purple','yellow']  # 可以根据需要继续添加更多颜色

# 绘制折线图
#plt.plot(steps, psnr_values_model1, marker='o', linestyle='-', color=colors[0], label='NET11')
plt.plot(steps, psnr_values_model2, marker='s', linestyle='-', color=colors[1], label='SR3')
plt.plot(steps, psnr_values_model3, marker='^', linestyle='-', color=colors[2], label='ddpm')
plt.plot(steps, psnr_values_model4, marker='^', linestyle='-', color=colors[3], label='lwtdm')
plt.plot(steps, psnr_values_model5, marker='o', linestyle='-', color=colors[4], label='NET13')
# 添加其他模型的折线，每条折线可以用不同的 color 和 label

# 设置图表信息
plt.xlabel('Step')
plt.ylabel('PSNR')
plt.title('PSNR over Steps')
plt.legend()  # 添加图例
plt.grid(True)
plt.show()